InformationRegisters/ДублиНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оригинал</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеУдаленияДубля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияУдаленияДублейНСИ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкиЗамены</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокЗамены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияУдаленияДублейНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияУдаленияДублейНСИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалениеНеПланируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированаЗаменаСсылокИУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаСсылокИУдалениеПриостановленыИзЗаОшибок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИНН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНДСПоСтавкам4и2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМеждународное</Name>
					<Comment>Наименование в латинской транскрипции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВТранскрипции</Name>
					<Comment>Наименование в русской транскрипции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>550</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияНаименований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СокращенноеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДублиНСИ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеСпискаРазрешено(ТипСсылки)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет новые записи и обновляет существующие, помечает дубли на удаление.
//
// Параметры:
//   Дубли - ТаблицаЗначений - коллекция дублей для добавления см. ШаблонНабораЗаписей.
//
Процедура ДобавитьДубли(Дубли) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ДатаДобавления = ТекущаяДатаСеанса();
	Для Каждого Дубль Из Дубли Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Дубль);
		НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
		НоваяЗапись.ДатаДобавления = ДатаДобавления;
		
		Если Дубль.СостояниеУдаленияДубля = Перечисления.СостоянияУдаленияДублейНСИ.ЗапланированаЗаменаСсылокИУдаление Тогда
			ДубльОбъект = Дубль.Дубль.ПолучитьОбъект();
			ДубльОбъект.Заблокировать();
			ДубльОбъект.ОбменДанными.Загрузка = Истина;
			ДубльОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДублиНСИ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = Дубли;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Дубль", "Дубль");
		Блокировка.Заблокировать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ИзменитьСтатусУдаленияДублей(Дубли, Состояние) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДублиНСИ.ТипСсылки КАК ТипСсылки,
		|	ДублиНСИ.Дубль КАК Дубль,
		|	ДублиНСИ.Оригинал КАК Оригинал,
		|	ДублиНСИ.Ответственный КАК Ответственный,
		|	ДублиНСИ.ДатаДобавления КАК ДатаДобавления,
		|	ДублиНСИ.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	ДублиНСИ.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования,
		|	ДублиНСИ.СостояниеУдаленияДубля КАК СостояниеУдаленияДубля,
		|	ДублиНСИ.ОшибкиЗамены КАК ОшибкиЗамены,
		|	ДублиНСИ.КоличествоПопытокЗамены КАК КоличествоПопытокЗамены
		|ИЗ
		|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
		|ГДЕ
		|	ДублиНСИ.Дубль В(&Дубли)";
	Запрос.УстановитьПараметр("Дубли", Дубли);
	
	НачатьТранзакцию();
	Попытка
		БлокировкаОтбор = Новый ТаблицаЗначений;
		БлокировкаОтбор.Колонки.Добавить("Дубль");
		БлокировкаОтбор.ЗагрузитьКолонку(Дубли, "Дубль");
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДублиНСИ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = БлокировкаОтбор;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Дубль", "Дубль");
		Блокировка.Заблокировать();
		
		НаборВыгрузка = Запрос.Выполнить().Выгрузить();
		
		ЗапланированаЗамена = Перечисления.СостоянияУдаленияДублейНСИ.ЗапланированаЗаменаСсылокИУдаление;
		Для Каждого Запись Из НаборВыгрузка Цикл
			ДубльОбъект = Запись.Дубль.ПолучитьОбъект();
			ДубльОбъект.Заблокировать();
			ДубльОбъект.ОбменДанными.Загрузка = Истина;
			Если Состояние = Перечисления.СостоянияУдаленияДублейНСИ.ЗапланированаЗаменаСсылокИУдаление Тогда
				ДубльОбъект.УстановитьПометкуУдаления(Истина);
			ИначеЕсли Состояние = Перечисления.СостоянияУдаленияДублейНСИ.УдалениеНеПланируется Тогда
				ДубльОбъект.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
			
			Запись.СостояниеУдаленияДубля = Состояние;
			Если Состояние = ЗапланированаЗамена Тогда
				Запись.КоличествоПопытокЗамены = 0;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(НаборВыгрузка);
		НаборЗаписей.Записать(РежимЗамещения.Обновление);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ДляПользователя = НСтр("ru = 'Не удалось изменить статус удаления дублей НСИ. Попробуйте позднее.'");
		ДляАдминистратора = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		ВызватьИсключение(ДляПользователя, , , ДляАдминистратора, ИнформацияОбОшибке);
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьДубли(Дубли, СнятьПометкуУдаления = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДублиНСИ.ТипСсылки КАК ТипСсылки,
		|	ДублиНСИ.Дубль КАК Дубль,
		|	ДублиНСИ.Оригинал КАК Оригинал,
		|	ДублиНСИ.Ответственный КАК Ответственный,
		|	ДублиНСИ.ДатаДобавления КАК ДатаДобавления,
		|	ДублиНСИ.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	ДублиНСИ.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования,
		|	ДублиНСИ.СостояниеУдаленияДубля КАК СостояниеУдаленияДубля,
		|	ДублиНСИ.ОшибкиЗамены КАК ОшибкиЗамены,
		|	ДублиНСИ.КоличествоПопытокЗамены КАК КоличествоПопытокЗамены
		|ИЗ
		|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
		|ГДЕ
		|	ДублиНСИ.Дубль В(&Дубли)";
	Запрос.УстановитьПараметр("Дубли", Дубли);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если СнятьПометкуУдаления Тогда
		Для Каждого Дубль Из Дубли Цикл
			ДубльОбъект = Дубль.ПолучитьОбъект();
			ДубльОбъект.ОбменДанными.Загрузка = Истина;
			ДубльОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДублиНСИ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Дубль", "Дубль");
		Блокировка.Заблокировать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Загрузить(РезультатЗапроса.Выгрузить());
	НаборЗаписей.Записать(РежимЗамещения.Удаление);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Конструктор для формирования набора записей.
//
// Возвращаемое значение:
//   ТаблицаЗначений: 
//     * Дубль - СправочникСсылка,ПланВидовХарактеристикСсылка.
//     * Тип - СправочникСсылка.ИдентификаторыОбъектовМетаданных.
//     * Оригинал - СправочникСсылка,ПланВидовХарактеристикСсылка.
//     * КоличествоМестИспользования - Число.
//     * ДатаПоискаМестИспользования - Дата.
//     * СостояниеУдаленияДубля - ПеречислениеСсылка.СостоянияУдаленияДублейНСИ.
//
Функция ШаблонНабораЗаписей() Экспорт 
	
	ТаблицаЗаписей = Новый ТаблицаЗначений;
	ТаблицаЗаписей.Колонки.Добавить("Дубль");
	ТаблицаЗаписей.Колонки.Добавить("ТипСсылки");
	ТаблицаЗаписей.Колонки.Добавить("Оригинал");
	ТаблицаЗаписей.Колонки.Добавить("КоличествоМестИспользования", Новый ОписаниеТипов("Число"));
	ТаблицаЗаписей.Колонки.Добавить("ДатаПоискаМестИспользования", Новый ОписаниеТипов("Дата"));
	ТаблицаЗаписей.Колонки.Добавить("СостояниеУдаленияДубля", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияУдаленияДублейНСИ"));

	Возврат ТаблицаЗаписей;
	
КонецФункции

Процедура ПересчитатьМестаИспользования(Дубли) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДублиНСИ.ТипСсылки КАК ТипСсылки,
		|	ДублиНСИ.Дубль КАК Дубль,
		|	ДублиНСИ.Оригинал КАК Оригинал,
		|	ДублиНСИ.Ответственный КАК Ответственный,
		|	ДублиНСИ.ДатаДобавления КАК ДатаДобавления,
		|	ДублиНСИ.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	ДублиНСИ.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования,
		|	ДублиНСИ.СостояниеУдаленияДубля КАК СостояниеУдаленияДубля,
		|	ДублиНСИ.ОшибкиЗамены КАК ОшибкиЗамены,
		|	ДублиНСИ.КоличествоПопытокЗамены КАК КоличествоПопытокЗамены
		|ИЗ
		|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
		|ГДЕ
		|	ДублиНСИ.Дубль В (&Дубли)";
	Запрос.УстановитьПараметр("Дубли", Дубли);
	НаборВыгрузка = Запрос.Выполнить().Выгрузить();
	
	ПодсчетСсылок = Новый Соответствие;
	ДатаПоиска = ТекущаяДатаСеанса();
	Для Каждого Дубль Из Дубли Цикл
		ИнформацияОСсылке = Новый Структура;
		ИнформацияОСсылке.Вставить("МестИспользования", 0);
		ИнформацияОСсылке.Вставить("ДатаПоискаМестИспользования", ДатаПоиска);
		
		ПодсчетСсылок.Вставить(Дубль, ИнформацияОСсылке);
	КонецЦикла;
	
	РезультатПоиска = ОбщегоНазначения.МестаИспользования(Дубли);
	Для Каждого СтрокаПоиска Из РезультатПоиска Цикл
		Если Не СтрокаПоиска.ЭтоСлужебныеДанные Тогда
			ИнформацияОСсылке = ПодсчетСсылок[СтрокаПоиска.Ссылка];
			ИнформацияОСсылке.МестИспользования = ИнформацияОСсылке.МестИспользования + 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДляЗаписи Из НаборВыгрузка Цикл
		ИнформацияОСсылке = ПодсчетСсылок[СтрокаДляЗаписи.Дубль];
		СтрокаДляЗаписи.КоличествоМестИспользования = ИнформацияОСсылке.МестИспользования;
		СтрокаДляЗаписи.ДатаПоискаМестИспользования = ИНформацияОСсылке.ДатаПоискаМестИспользования;
	КонецЦикла;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(НаборВыгрузка);
	НаборЗаписей.Записать(РежимЗамещения.Обновление);
	
КонецПроцедуры

// Формирует список пар "дубль-оригинал" для замены ссылок в базе.
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение - пары для замены, где ключ - дублирующая ссылка, значение - оригинальная ссылка:
//    * Ключ - СправочникСсылка,ПланВидовХарактеристикСсылка
//    * Значение - СправочникСсылка,ПланВидовХарактеристикСсылка
//
Функция ПарыЗамен() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДублиНСИ.Дубль КАК Дубль,
	|	ДублиНСИ.Оригинал КАК Оригинал,
	|	ТИПЗНАЧЕНИЯ(ДублиНСИ.Дубль) КАК ТипДублей
	|ИЗ
	|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
	|ГДЕ
	|	ДублиНСИ.СостояниеУдаленияДубля = &СостояниеУдаленияДубля
	|	И ДублиНСИ.КоличествоПопытокЗамены < &КоличествоПопытокЗамены
	|ИТОГИ
	|ПО
	|	ТипДублей";
	
	Запрос.УстановитьПараметр("СостояниеУдаленияДубля", Перечисления.СостоянияУдаленияДублейНСИ.ЗапланированаЗаменаСсылокИУдаление);
	Запрос.УстановитьПараметр("КоличествоПопытокЗамены", 3);
	
	НевозможныеЗамены = Новый ТаблицаЗначений;
	НевозможныеЗамены.Колонки.Добавить("Ссылка");
	НевозможныеЗамены.Колонки.Добавить("ДубльРодитель");
	НевозможныеЗамены.Колонки.Добавить("ТекстОшибки");
	НевозможныеЗамены.Колонки.Добавить("ОбъектОшибки");
	НевозможныеЗамены.Индексы.Добавить("Ссылка");
	
	ПарыЗамен = Новый Соответствие;
	ДублиИОригиналы = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаПоТипам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаПоТипам.Следующий() Цикл
		
		ПарыЗаменПоТипу = Новый Соответствие;
		
		Выборка = ВыборкаПоТипам.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПарыЗаменПоТипу.Вставить(Выборка.Дубль, Выборка.Оригинал);
		КонецЦикла;
		
		ПоискИЗаменаДублейНСИПереопределяемый.ПроверитьВозможностьЗаменыДублей(ПарыЗаменПоТипу, НевозможныеЗамены, ВыборкаПоТипам.ТипДублей);
		
		Для Каждого Пара Из ПарыЗаменПоТипу Цикл
			Если НевозможныеЗамены.Найти(Пара.Ключ) = Неопределено Тогда
				ПарыЗамен.Вставить(Пара.Ключ, Пара.Значение);
				ДублиИОригиналы.Добавить(Пара.Ключ);
				ДублиИОригиналы.Добавить(Пара.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если ВыборкаПоТипам.ТипДублей = Тип("СправочникСсылка.Партнеры")
			И ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
			
			ДобавитьКонтрагентов(ПарыЗаменПоТипу, ПарыЗамен, НевозможныеЗамены, ДублиИОригиналы);
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПоиска = ОбщегоНазначения.МестаИспользования(ДублиИОригиналы);
	ТаблицаПоиска.Индексы.Добавить("Данные");
	УстановитьПривилегированныйРежим(Ложь);
	
	ПроверитьВозможностьЗаменыДублей(ПарыЗамен, ТаблицаПоиска, НевозможныеЗамены);
	ПроверитьВозможностьЗаменыДублейИмитацияЗамены(ПарыЗамен, ТаблицаПоиска, НевозможныеЗамены);
	
	Если НевозможныеЗамены.Количество() Тогда
		ОбновитьИнформациюОбОшибкахЗамены(НевозможныеЗамены);
	КонецЕсли;
	
	Для Каждого НевалидныйДубль Из НевозможныеЗамены Цикл
		ПарыЗамен.Удалить(НевалидныйДубль.Ссылка);
	КонецЦикла;
	
	Возврат ПарыЗамен;
	
КонецФункции

Процедура ДобавитьКонтрагентов(Партнеры, ПарыЗамен, НевозможныеЗамены, ДублиИОригиналы)
	
	МассивПартнеров = Новый Массив;
	Для Каждого КлючИЗначение Из Партнеры Цикл
		МассивПартнеров.Добавить(КлючИЗначение.Ключ);
		МассивПартнеров.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Партнер КАК Партнер,
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Партнер В (&Партнеры)";
	Запрос.УстановитьПараметр("Партнеры", МассивПартнеров);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Контрагенты = Новый Соответствие;
	Для Каждого КлючИЗначение Из Партнеры Цикл
		СтрокаДубль = РезультатЗапроса.Найти(КлючИЗначение.Ключ, "Партнер");
		СтрокаОригинал = РезультатЗапроса.Найти(КлючИЗначение.Значение, "Партнер");
		
		Если СтрокаДубль <> Неопределено И СтрокаОригинал <> Неопределено Тогда
			Контрагенты.Вставить(СтрокаДубль.Контрагент, СтрокаОригинал.Контрагент);
		КонецЕсли;
	КонецЦикла;
	
	ПоискИЗаменаДублейНСИПереопределяемый.ПроверитьВозможностьЗаменыДублей(
		Контрагенты, НевозможныеЗамены, Тип("СправочникСсылка.Контрагенты"));
		
	Для Каждого Пара Из Контрагенты Цикл
		Если НевозможныеЗамены.Найти(Пара.Ключ) = Неопределено Тогда
			ПарыЗамен.Вставить(Пара.Ключ, Пара.Значение);
			ДублиИОригиналы.Добавить(Пара.Ключ);
			ДублиИОригиналы.Добавить(Пара.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьВозможностьЗаменыДублей(ПарыЗамен, ТаблицаПоиска, НевалидныеДубли)
	
	ИндексПоиска = Новый Соответствие;
	Для Каждого СтрокаПоиска Из ТаблицаПоиска Цикл
		
		Если СтрокаПоиска.ЭтоСлужебныеДанные Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектОшибки = СтрокаПоиска.Данные;
		Если ИндексПоиска[ОбъектОшибки] = Неопределено Тогда
			ИндексПоиска[ОбъектОшибки] = Новый Массив;
		КонецЕсли;
		ИндексПоиска[ОбъектОшибки].Добавить(СтрокаПоиска.Ссылка);
		
	КонецЦикла;
	
	Для Каждого ПараЗамены Из ПарыЗамен Цикл
		Для Каждого СтрокаПоиска Из ИндексПоиска Цикл
			СсылкиВнутриОбъекта = СтрокаПоиска.Значение;
			
			Если СсылкиВнутриОбъекта.Найти(ПараЗамены.Ключ) <> Неопределено
				И СсылкиВнутриОбъекта.Найти(ПараЗамены.Значение) <> Неопределено Тогда
				
				НевалидныйДубль = НевалидныеДубли.Добавить();
				НевалидныйДубль.Ссылка = ПараЗамены.Ключ;
				НевалидныйДубль.ТекстОшибки = НСтр("ru = 'Дубль и оригинал находятся в одном объекте. Замена ссылок невозможна.'");
				НевалидныйДубль.ОбъектОшибки = СтрокаПоиска.Ключ;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьВозможностьЗаменыДублейИмитацияЗамены(ПарыЗамен, Знач ТаблицаПоиска, НевалидныеДубли)
	
	КоличествоСтрок = ТаблицаПоиска.Количество();
	Если КоличествоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	СтрокиТаблицыПоиска = Новый Массив(КоличествоСтрок);
	Для Индекс = 0 По КоличествоСтрок - 1 Цикл
		СтрокиТаблицыПоиска[Индекс] = ТаблицаПоиска[Индекс];
	КонецЦикла;
	
	Для Каждого СтрокаПоиска Из СтрокиТаблицыПоиска Цикл // СтрокаТаблицыЗначений
		
		Если СтрокаПоиска.ЭтоСлужебныеДанные Тогда
			Продолжить;
		КонецЕсли;
		
		Оригинал = ПарыЗамен[СтрокаПоиска.Ссылка];
		Если Оригинал = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПоиска.Ссылка = Оригинал;
		Отбор = Новый Структура("Данные", СтрокаПоиска.Данные);
		ОтборПоДанным = ТаблицаПоиска.НайтиСтроки(Отбор);
		ПроверитьВозможностьЗаменыДублей(ПарыЗамен, ОтборПоДанным, НевалидныеДубли);
		
	КонецЦикла
	
КонецПроцедуры

// Обновляет информацию об ошибках замены дублей НСИ в регистре сведений и увеличивает счетчик попыток замены.
//
// Параметры:
//   ОшибкиЗамены - ТаблицаЗначений - ключевые колонки:
//      * Ссылка - ЛюбаяСсылка
//      * ТекстОшибки - Строка
//      * ОбъектОшибки - ЛюбаяСсылка
//
Процедура ОбновитьИнформациюОбОшибкахЗамены(ОшибкиЗамены) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДублиНСИ.ТипСсылки КАК ТипСсылки,
	|	ДублиНСИ.Дубль КАК Дубль,
	|	ДублиНСИ.Оригинал КАК Оригинал,
	|	ДублиНСИ.Ответственный КАК Ответственный,
	|	ДублиНСИ.ДатаДобавления КАК ДатаДобавления,
	|	ДублиНСИ.КоличествоМестИспользования КАК КоличествоМестИспользования,
	|	ДублиНСИ.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования,
	|	ДублиНСИ.СостояниеУдаленияДубля КАК СостояниеУдаленияДубля,
	|	ДублиНСИ.ОшибкиЗамены КАК ОшибкиЗамены,
	|	ДублиНСИ.КоличествоПопытокЗамены КАК КоличествоПопытокЗамены
	|ИЗ
	|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
	|ГДЕ
	|	ДублиНСИ.Дубль В (&Дубли)";
	
	Запрос.УстановитьПараметр("Дубли", ОшибкиЗамены.ВыгрузитьКолонку("Ссылка"));
	НаборДляОбновления = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Запись Из НаборДляОбновления Цикл
		
		ИнформацияОбОшибках = Новый Структура;
		ИнформацияОбОшибках.Вставить("Дубль", Запись.Дубль);
		ИнформацияОбОшибках.Вставить("Оригинал", Запись.Оригинал);
		ИнформацияОбОшибках.Вставить("Ошибки", Новый Массив);
		
		КоллекцияОшибок = ОшибкиЗамены.НайтиСтроки(Новый Структура("ДубльРодитель", Запись.Дубль));
		
		Для Каждого ОшибкаЗамены Из КоллекцияОшибок Цикл
			ИнформацияОбОшибке = Новый Структура("ТекстОшибки, ОбъектОшибки");
			ЗаполнитьЗначенияСвойств(ИнформацияОбОшибке, ОшибкаЗамены);
			ИнформацияОбОшибках.Ошибки.Добавить(ИнформацияОбОшибке);
		КонецЦикла;
		
		Запись.ОшибкиЗамены = Новый ХранилищеЗначения(ИнформацияОбОшибках, Новый СжатиеДанных(9));
		Запись.КоличествоПопытокЗамены = Запись.КоличествоПопытокЗамены + 1;
		
		Если Запись.КоличествоПопытокЗамены > 2 Тогда
			Запись.СостояниеУдаленияДубля = Перечисления.СостоянияУдаленияДублейНСИ.ЗаменаСсылокИУдалениеПриостановленыИзЗаОшибок;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(НаборДляОбновления);
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать(РежимЗамещения.Обновление);
	
КонецПроцедуры

// Возвращает структуру с информацией об ошибках замены для указанного дубля.
//
// Параметры:
//   Дубль - СправочникСсылка,ПланВидовХарактеристикСсылка - Ссылка на дублируемый элемент
//
// Возвращаемое значение:
//   Структура:
//     *Дубль - СправочникСсылка,ПланВидовХарактеристикСсылка
//     *Оригинал - СправочникСсылка,ПланВидовХарактеристикСсылка
//     *Ошибки - Массив из Структура:
//        **ТекстОшибки - Строка
//        **ОбъектОшибки - ЛюбаяСсылка
//
Функция ОшибкиЗаменыДубля(Дубль)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДублиНСИ.ОшибкиЗамены КАК ОшибкиЗамены
	|ИЗ
	|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
	|ГДЕ
	|	ДублиНСИ.Дубль = &Дубль";
	
	Запрос.УстановитьПараметр("Дубль", Дубль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура("Дубль, Оригинал, Ошибки");
	ЗаполнитьЗначенияСвойств(Результат, Выборка.ОшибкиЗамены.Получить());
	Возврат Результат;
	
КонецФункции

// Возвращает типы ссылок дублируемых объектов НСИ.
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//      * ТипСсылки - СправочникСсылка.ИдентификаторыОбъектовМетаданных - тип ссылки на дублируемый объект.
//
Функция ТипыДублей()Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДублиНСИ.ТипСсылки КАК ТипСсылки
		|ИЗ
		|	РегистрСведений.ДублиНСИ КАК ДублиНСИ";
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
